# This is a sample Python script.

# Press Shift+F10 to execute it or replace it with your code.
# Press Double Shift to search everywhere for classes, files, tool windows, actions, and settings.


def print_hi(name):
    # Use a breakpoint in the code line below to debug your script.
    print(f'Hi, {name}')  # Press Ctrl+F8 to toggle the breakpoint.


# Press the green button in the gutter to run the script.
if __name__ == '__main__':
    print_hi('PyCharm')

# See PyCharm help at https://www.jetbrains.com/help/pycharm/


# 2.Создать свой проект название придумайте сами
# 3.Провести настройки проекта как делали на первой части урока
# (настройки для templates yes media yes  static, super user yes , migrate yes, pillow yes )
# 4.Создать новое второстепенное приложение books указать поля в модели
# name, description, image, price, author created_at yes
# далее не забудьте сделать миграции makemigrations, migrate.
# 5.Прописать views.py, urls.py yes,  template_file
# 6.Вывести все данные о книге как делали на уроке

